In [1]:
import pandas as pd
import numpy as np

In [3]:
train_df = pd.read_csv('./titanic/train.csv')
test_df = pd.read_csv('./titanic/test.csv')
submission = pd.read_csv('./titanic/gender_submission.csv')

In [11]:
train_df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [12]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
plt.style.use('ggplot')

In [15]:
train_df[['Age', 'Cabin', 'Embarked']]

      Age Cabin Embarked
0    22.0   NaN        S
1    38.0   C85        C
2    26.0   NaN        S
3    35.0  C123        S
4    35.0   NaN        S
..    ...   ...      ...
886  27.0   NaN        S
887  19.0   B42        S
888   NaN   NaN        S
889  26.0  C148        C
890  32.0   NaN        Q

[891 rows x 3 columns]

In [16]:
train_df[['Age', 'Cabin', 'Embarked']].dropna()

      Age        Cabin Embarked
1    38.0          C85        C
3    35.0         C123        S
6    54.0          E46        S
10    4.0           G6        S
11   58.0         C103        S
..    ...          ...      ...
871  47.0          D35        S
872  33.0  B51 B53 B55        S
879  56.0          C50        C
887  19.0          B42        S
889  26.0         C148        C

[183 rows x 3 columns]

In [18]:
train_df[['Survived', 'PassengerId', 'Embarked']].dropna().groupby(['Embarked', 'Survived']).count()

                   PassengerId
Embarked Survived
C        0                  75
         1                  93
Q        0                  47
         1                  30
S        0                 427
         1                 217